from html.parser import HTMLParser

# กำหนดที่อยู่ของไฟล์ PDFBox
PATH_TO_PDF_BOX = 'pdfbox-app-3.0.3.jar'

# ตารางการแปลงตัวอักษร PUA (Private Use Area) เป็นตัวอักษร Unicode สำหรับภาษาไทย
PUA = {
    '63233': '&#3636;',  # Sara I (สระ อิ)
    '63234': '&#3637;',  # Sara Ii (สระ อี)
    '63235': '&#3638;',  # Sara U (สระ อุ)
    '63236': '&#3639;',  # Sara Uu (สระ อู)
    '63237': '&#3656;',  # Mai Ek (ไม้เอก)
    '63238': '&#3657;',  # Mai Tho (ไม้โท)
    '63239': '&#3658;',  # Mai Tri (ไม้ตรี)
    '63240': '&#3657;',  # Mai Tho (ไม้โท on Po Pla)
    '63241': '&#3652;',  # Thantakat (ทัณฑฆาต on Po Pla)
    '63242': '&#3656;',  # Mai Ek (ไม้เอก)
    '63243': '&#3657;',  # Mai Tho (ไม้โท)
    '63244': '&#3658;',  # Mai Tri (ไม้ตรี)
    '63245': '&#3659;',  # Mai Chattawa (ไม้จัตวา)
    '63246': '&#3660;',  # Thantakat (ทัณฑฆาต)
    '63247': '&#3597;',  # Yo Ying (ญ หญิง)
    '63248': '&#3633;',  # Mai Han Akhat (ไม้หันอากาศ on Po Pla)
    '63249': '&#3654;',  # Yamakkan (ยามักการ)
    '63250': '&#3655;',  # Mai Tai Khu (ไม้ไต่คู้ on Po Pla)
    '63251': '&#3656;',  # Mai Ek (ไม้เอก)
    '63252': '&#3657;',  # Mai Tho (ไม้โท)
    '63253': '&#3658;',  # 0xf715
    '63254': '&#3659;',  # 0xf716
    '63255': '&#3660;',  # 0xf717
    '63256': '&#3661;',  # 0xf718
    '63257': '&#3662;',  # 0xf719
    '63258': '&#3663;',  # 0xf71a
    '63259': '&#3664;',  # 0xf71b
    '63260': '&#3665;',  # 0xf71c
    '63261': '&#3666;',  # 0xf71d
    '63262': '&#3667;',  # 0xf71e
    '63263': '&#3668;',  # 0xf71f
    '63264': '&#3669;',  # 0xf720
    '63265': '&#3670;',  # 0xf721
    '63266': '&#3671;',  # 0xf722
    '63267': '&#3672;',  # 0xf723
    '63268': '&#3673;',  # 0xf724
    '63269': '&#3674;',  # 0xf725
    '63270': '&#3675;',  # 0xf726
    '63271': '&#3676;',  # 0xf727
    '63272': '&#3677;',  # 0xf728
    '63273': '&#3678;',  # 0xf729
    '63274': '&#3679;',  # 0xf72a
    '63275': '&#3680;',  # 0xf72b
    '63276': '&#3681;',  # 0xf72c
    '63277': '&#3682;',  # 0xf72d
    '63278': '&#3683;',  # 0xf72e
    '63279': '&#3684;',  # 0xf72f
    '63280': '&#3685;',  # 0xf730
    '63281': '&#3686;',  # 0xf731
    '63282': '&#3687;',  # 0xf732
    '63283': '&#3688;',  # 0xf733
    '63284': '&#3689;',  # 0xf734
    '63285': '&#3690;',  # 0xf735
    '63286': '&#3691;',  # 0xf736
    '63287': '&#3692;',  # 0xf737
    '63288': '&#3693;',  # 0xf738
    '63289': '&#3694;',  # 0xf739
    '63290': '&#3695;',  # 0xf73a
    '63291': '&#3696;',  # 0xf73b
    '63292': '&#3697;',  # 0xf73c
    '63293': '&#3698;',  # 0xf73d
    '63294': '&#3699;',  # 0xf73e
    '63295': '&#3700;',  # 0xf73f
    '61482': '&#42;',   # เครื่องหมายดอกจัน *
    '61591': '&#8226;', # จุดกลมใหญ่ •
    '65288': '&#40;',   # วงเล็บเปิด (
    '65289': '&#41;',   # วงเล็บปิด )
    '61623': '&#8226;', # จุดกลมใหญ่ •
    '65309': '&#61;',   # เท่ากับ =
    '65293': '&#45;',   # ลบ -
    '65374': '&#126;',  # ทิลด้า ~
}

# การแปลงตัวเลขไทยเป็นตัวเลขอารบิก
DIGITS = {
    '๐': '0',
    '๑': '1',
    '๒': '2',
    '๓': '3',
    '๔': '4',
    '๕': '5',
    '๖': '6',
    '๗': '7',
    '๘': '8',
    '๙': '9'
}

class TAG_STRIPPER(HTMLParser):
    """
    คลาส TAG_STRIPPER ใช้สำหรับแยกและลบแท็ก HTML ออกจากข้อความ
    
    Attributes:
        fed (list): เก็บข้อความที่ไม่มีแท็ก HTML
        
    Methods:
        handle_data(d): เก็บข้อมูลที่ไม่มีแท็ก HTML ไว้ใน self.fed
        get_data(): คืนค่าข้อความที่ไม่มีแท็ก HTML ที่ถูกเก็บไว้ใน self.fed
    """
    
    def __init__(self):
        super().__init__()
        self.strict = False
        self.convert_charrefs = True
        self.fed = []

    def handle_data(self, d):
        """
        เก็บข้อมูลที่ไม่มีแท็ก HTML ไว้ใน self.fed
        
        Args:
            d (str): ข้อมูลที่ไม่มีแท็ก HTML
        """
        self.fed.append(d)

    def get_data(self):
        """
        คืนค่าข้อความที่ไม่มีแท็ก HTML ที่ถูกเก็บไว้ใน self.fed
        
        Returns:
            str: ข้อความที่ไม่มีแท็ก HTML
        """
        return ''.join(self.fed)
